[
  {
    "id": 1001,
    "title": "Pengenalan HTML",
    "content": "<h1>Apa itu HTML?</h1><p>HTML (HyperText Markup Language) adalah bahasa standar untuk membuat halaman web. HTML menggunakan elemen-elemen seperti tag untuk menyusun struktur dan konten pada halaman web. Tag umum antara lain <b>&lt;p&gt;</b> untuk paragraf, <b>&lt;a&gt;</b> untuk tautan, dan <b>&lt;img&gt;</b> untuk gambar.</p>"
  },
  {
    "id": 1002,
    "title": "Dasar-Dasar CSS",
    "content": "<h1>Dasar CSS</h1><p>CSS (Cascading Style Sheets) digunakan untuk mengatur tampilan halaman web. Dengan CSS, kita bisa mengatur warna, ukuran font, margin, dan tata letak elemen. Contoh: <b>color: blue;</b> mengubah warna teks menjadi biru.</p>"
  },
  {
    "id": 1003,
    "title": "Pengenalan JavaScript",
    "content": "<h1>JavaScript Dasar</h1><p>JavaScript adalah bahasa pemrograman yang digunakan untuk membuat halaman web menjadi interaktif. Contohnya, kita bisa membuat tombol yang menampilkan alert, atau mengubah isi teks di halaman menggunakan fungsi <b>document.getElementById()</b>.</p>"
  },
  {
    "id": 1004,
    "title": "Belajar Dasar AI",
    "content": "Penerapan AI dalam Dunia Nyata\nMari kita mulai pembelajaran ini dengan mengenal penerapan AI di dunia nyata. Menurut laporan McKinsey yang berjudul The state of AI in 2022, rata-rata penggunaan AI di industri meningkat dua kali lipat dari 20% pada tahun 2017 menjadi 50% pada tahun 2022[1]. Laporan tersebut juga menyatakan bahwa 31% industri memanfaatkan teknologi AI untuk meningkatkan kualitas produk dan layanan mereka. Hal ini menunjukkan bahwa penerapan AI sudah ada di berbagai bidang industri saat ini. Berikut merupakan contoh-contoh industri yang sudah menerapkan AI.\n\ndos-18f4840f74c1ea30cd0e64894149acce20231217181102.jpeg\n\nSeperti yang Anda lihat pada gambar di atas, penerapan AI sudah ada pada seluruh bidang pekerjaan. Namun, pada kesempatan ini, kita akan membahas dua contoh saja yang sering ditemui. Tanpa berlama-lama, mari kita uraikan beberapa contoh penerapan AI pada dunia nyata di bawah ini.\n\nSmart Speaker\ndos-6953214a43693d29a469c3b248ade15220231217181103.jpeg\n\nSmart Speaker merupakan perangkat inovatif yang dilandasi oleh teknologi AI sehingga memiliki kemampuan untuk melakukan tugas berdasarkan perintah verbal. Kelebihan utama smart speaker terletak pada fleksibilitasnya dalam memberikan jawaban terhadap tugas yang diberikan pengguna. Alat ini dapat merespon perintah verbal yang kita ucapkan mulai dari membuka aplikasi, menjalankan penghitung waktu, memutar musik, hingga memberikan informasi yang kita butuhkan. Contohnya, jika kita mengucapkan “berikan contoh pantun lucu”, smart speaker akan langsung memberikan pantun lucu sesuai permintaan kita.\n\nPertanyaannya bagaimana cara membuat perangkat memiliki kemampuan untuk memahami perintah verbal dan memberikan respons pada kita? Pada contoh kasus ini, terdapat beberapa langkah hingga smart speaker dapat merespons perintah yang kita berikan. Mari kita uraikan langkah-langkahnya bersama.\n\nPertama, kita harus memberikan kata pemicu yang telah ditentukan oleh algoritma alat ini. Seperti contohnya pada Google kata pemicunya yaitu “Ok, Google!” Lalu, setelah perangkat mendeteksi kata pemicu, ia akan mengembalikan nilai True atau False yang nantinya akan dilanjutkan pada langkah berikutnya.\nSetelah perangkat memberikan status True, ia akan melakukan pengenalan suara untuk mendeteksi perintah yang diberikan. Misalnya, perintah yang dapat diberikan adalah “berikan contoh pantun lucu”. Setelah perintah diterima, perangkat akan melakukan pemetaan audio menjadi sebuah teks.\nLangkah ketiga merupakan langkah paling kompleks. Pada tahap ini perangkat harus mencari tahu maksud sebenarnya dari perintah yang diberikan oleh pengguna. Hal tersebut akan diolah oleh algoritma yang telah dibangun sebelumnya hingga mendapatkan maksud dari perintah yang diberikan.\nTerakhir adalah proses eksekusi dari apa yang diminta oleh pengguna kepada smart speaker. Pada kasus ini, perintah akan dieksekusi dengan mengembalikan audio yang berisi pantun lucu.\nSampai di sini mungkin beberapa dari kalian terbesit pertanyaan “teknologi apa yang digunakan pada smart speaker sehingga dapat melakukan hal tersebut?” Smart speaker menggunakan Natural Language Processing sehingga memiliki kemampuan untuk menerima dan memproses sebuah perintah verbal yang diberikan pengguna. Kita akan membahas algoritma dari penerapan AI ini pada modul berikutnya ya. Oleh karena itu, tetap semangat, ya karena perjalanan ini akan terasa menyenangkan bagi kita semua.\n\nSelf-driving car\nBerbicara tentang penerapan AI, hal yang paling menarik pada era ini adalah Self-driving Car, salah satu perusahaan yang memiliki teknologi tersebut ialah Tesla. Beberapa dari kalian mungkin penasaran tentang “bagaimana sih cara kerja dari teknologi self-driving car?” Untuk menjawab rasa penasaran tersebut. Simak uraiannya di bawah ini.\n\nMari kita awali dari proses sebuah mobil dapat memahami berbagai macam perintah, mulai dari langkah utama untuk mendapatkan input hingga dapat mengemudikan dirinya sendiri secara otomatis. Mobil ini akan menerima input dari berbagai sensor, seperti gambar yang ada di sekitarnya dan mengukur jarak dengan objek lain dari posisi sensor menggunakan sensor Light Detection and Ranging (LIDAR). Perhatikan gambar berikut untuk mengetahui detailnya.\n\ndos-700d4a6a48dc509727d0a51421950d2120231217181101.jpeg\n\nDengan input tersebut mobil ini dapat mendeteksi mobil lain serta pejalan kaki. Pendeteksian ini dapat dilakukan dengan melakukan pemetaan sehingga dapat mengirimkan input dan memberikan informasi posisi mobil dan pejalan kaki lainnya. Setelah mengetahui lokasi dari objek lainnya, informasi tersebut akan digunakan untuk perancangan gerakan pada perangkat lunak yang dibangun sehingga dapat membuat keputusan dan menghindari tabrakan.\n\nApakah kalian bertanya-tanya bagaimana mobil tersebut bisa menghindari tabrakan? Jika kalian berpikir demikian, mari kita bahas hal tersebut. Setelah mobil tersebut mendapatkan input dari sensor yang ada, input tersebut akan diolah menggunakan beberapa algoritma seperti convolutional neural network dan djikstra. Algoritma tersebut bertugas untuk mengolah data input agar dapat memberikan respons terhadap kemudi, gas, serta rem untuk memberikan perintah agar dapat berjalan dengan baik dan benar.\n\nSatu hal yang perlu kalian ketahui, kedua contoh penerapan AI tersebut hanya menceritakan garis besar penerapannya. Oleh karena itu, mari kita bahas bagaimana pengembangan AI secara lebih dalam pada materi yang akan datang yaitu Pengenalan AI! Sudahkah Anda siap untuk melaju ke materi selanjutnya? Mari kita melangkah!"
  },
  {
    "id": 1005,
    "title": "Pengenalan AI",
    "content": "Pengenalan AI\nSetelah membaca contoh penerapan AI di dunia nyata, apakah Anda menyadari keberadaan AI di sekitar kita? Ternyata banyak sekali penerapannya di kehidupan sehari-hari. Apakah terbesit di benak Anda sebuah pertanyaan “apa sih AI itu sebenarnya?” Jika hal tersebut muncul, mari kita bahas AI mulai dari sejarahnya!\n\nSadar atau tidak, AI bukanlah sebuah teknologi yang baru ditemukan. Ada banyak sekali perdebatan terkait kapan AI pertama kali dibahas. Namun, mari kita mulai dengan perkembangan AI pada tahun 1950 sebelum konferensi pertama tentang AI dilaksanakan.\n\ndos-65ac0d17740f90283740422df831504a20231217181430.jpegJohn McCarthy dan Marvin Minsky sebagai pencetus konferensi AI\n\nAI pertama kali dikembangkan pada tahun 1950 oleh John McCarthy, Marvin Minsky, dan para ilmuwan lainnya di Massachusetts Institute of Technology (MIT) yang membentuk kelompok penelitian untuk mempelajari AI. Mereka menciptakan program-program komputer yang dapat meniru kemampuan manusia, seperti pemrosesan bahasa alami dan permainan catur. Hingga muncul satu statement dari salah satu peneliti bernama Turing yang menyebutkan “jika manusia mampu menyelesaikan masalah dan membuat keputusan berdasarkan informasi dan tatanan yang tersedia, mengapa mesin tidak bisa melakukan hal yang sama?”.\n\nHal tersebut membuat para peneliti semakin bersemangat dan yakin bahwa AI merupakan ilmu yang patut untuk dikembangkan. Lalu, pada tahun 1956 dibuatlah sebuah konferensi AI Darthmouth Summer Research Project on Artificial Intelligence (DSRPAI) yang menjadi tonggak awal perkembangan AI sebagai bidang ilmu yang mandiri. Pada konferensi ini, para ilmuwan sepakat untuk memusatkan perhatian mereka pada pembangunan program-program komputer yang mampu \"belajar\" dan \"berpikir\" seperti manusia.\n\nHingga saat ini, perkembangan AI sangatlah pesat terutama dengan munculnya machine learning dan deep learning yang memungkinkan komputer belajar dari data dan meningkatkan kinerjanya secara mandiri. Salah satu contoh pengembangan AI yang sedang ramai diperbincangkan belakangan ini yaitu ChatGPT.\n\nChatGPT sendiri merupakan salah satu bentuk pengembangan AI yang dapat mempermudah kita dalam mencari tahu akan semua hal. Namun, perlu diingat kembali bahwa hasil dari pencarian tersebut harus kita validasi kembali karena beberapa memiliki ketidakakuratan dalam informasi yang disediakan. Oleh karena itu, penggunaan ChatGPT harus dilakukan dengan bijak dan mempertimbangkan etika dan validitas informasi yang dihasilkan.\n\nSelain itu, AI juga sudah merambah dengan jumlah yang sangat besar ke dalam industri perangkat lunak, retail, perjalanan, transportasi, otomotif, bahan baku, manufaktur, dan sebagainya.\n\nOke, setelah mengetahui sejarah dan contoh pengembangan AI, mungkin Anda bertanya, “Apa itu AI dan bagaimana kita mendefinisikan AI?”\n\nSecara singkat, AI atau kecerdasan buatan adalah ilmu tentang mengajarkan mesin untuk belajar, bertindak, dan berpikir seperti manusia untuk melakukan tugas-tugas dalam kehidupan nyata. Berangkat dari hal tersebut, bagaimana caranya kita bisa memberikan kemampuan kognitif pada mesin? Mari kita bahas tuntas pertanyaan tersebut di kelas Belajar Dasar AI ini.\n\nAI dibuat untuk membantu memecahkan masalah kognitif yang umumnya terkait dengan kecerdasan manusia, seperti pembelajaran, pemecahan masalah, dan pengenalan pola.\n\nDengan demikian penerapan AI dapat membantu memecahkan masalah dengan cara yang cerdas menggunakan algoritma. Dengan menggunakan cara yang cerdas tersebut kita tidak perlu lagi melakukan hal yang sama berulang-ulang dan dapat menghindari kesalahan manusia.\n\nNamun, apakah kalian penasaran apa yang dimaksud “cara yang cerdas”? Cara yang cerdas ini dapat didefinisikan sebagai cara yang terinspirasi dari kecerdasan manusia dan dilakukan dengan pendekatan komputasi sehingga komputer dapat menemukan pola dari data yang diberikan kepadanya. Cara ini melibatkan proses pembelajaran komputer terhadap data sehingga menghasilkan aturan yang bisa digunakan untuk menyelesaikan permasalahan.\n\nNah, dengan menerapkan AI kita tidak perlu memprogram komputer secara eksplisit. Dengan cara yang cerdas ini, AI dapat mempelajari pola pada data yang diberikan dan menghasilkan aturan dengan sendirinya.\n\nDengan kata lain, AI atau Artificial Intelligence merupakan teknologi yang menggunakan komputer untuk menyelesaikan tugas secara otomatis dengan sedikit campur tangan manusia atau bahkan tanpa campur tangan manusia sama sekali. Keren, bukan?\n\nPada kelas ini, Anda akan mempelajari cara untuk memberikan kemampuan pada komputer untuk melakukan apa yang bisa dilakukan oleh manusia. Oleh karena itu, mari kita pahami lebih lanjut pada materi yang akan datang."
  },
  {
    "id": 1006,
    "title": "Taksonomi AI",
    "content": "Taksonomi AI\nAnda telah berkenalan dengan AI pada materi sebelumnya, kita sudah mengetahui bagaimana sejarah AI dan pengertiannya. Setelah Anda mengetahui hal tersebut, mungkin terbesit di benak Anda pertanyaan, “Apa saja kelompok ilmu yang ada pada AI”? Jika benar kalimat itu yang terbesit, berarti Anda berada di jalan yang benar!\n\nBerangkat dari materi sebelumnya, pengertian AI sangatlah luas dan banyak sekali kelompok keilmuan di dalamnya. Oleh karena itu, mari kita jelajahi bersama kelompok ilmu atau bisa disebut taksonomi AI secara runut.\n\ndos-1c601ed20cdd9f9d1696cb0b1da6e96620231217182341.jpeg\n\nArtificial Intelligence (AI)\nSebelumnya telah kita bahas terkait pengenalan AI mengenai sejarah hingga pengertiannya, lalu bagaimana Anda mendefinisikan AI? Yap, AI adalah teknologi yang menerapkan peniruan perilaku manusia terhadap komputer supaya dapat mempelajari dan melakukan tugas tanpa perlu bantuan eksplisit tentang output yang diharapkan. Nah, dengan penjelasan tersebut, AI memungkinkan komputer untuk belajar dari pengalaman, mengidentifikasi pola, membuat keputusan, dan menyelesaikan tugas-tugas kompleks dengan cepat dan efisien.\n\nMachine Learning (ML)\nMachine Learning (ML) merupakan salah satu bagian dari kelompok keilmuan AI yang secara otomatis dapat belajar dan berkembang berdasarkan pengalamannya. Machine learning adalah sebuah teknologi yang menggunakan metode statistika untuk membuat komputer dapat mempelajari pola pada data tanpa perlu diprogram secara eksplisit. ML bergantung pada algoritma yang digunakan untuk menganalisis data dalam jumlah yang besar, belajar dari pengetahuan berdasarkan data, dan memberikan keputusan berdasarkan pengalaman yang dipelajarinya dengan tepat.\n\nMachine Learning menggunakan algoritma untuk melakukan pembelajaran dan meningkatkan performa dari waktu ke waktu hingga mencapai target yang diinginkan. Proses pembelajaran ini disebut dengan training/pelatihan yang mana algoritma yang digunakan akan terus belajar dan memperbaiki pengetahuannya berdasarkan data yang diberikan.\n\nNah, setelah melewati proses tersebut, kita akan mendapatkan sebuah output dari proses pembelajaran mesin tersebut. Output akhir dari pengembangan Machine Learning itu sendiri merupakan sebuah model yang dapat melakukan tugas berdasarkan data pelatihan yang diberikan. Semakin banyak data yang digunakan, semakin baik pula modelnya.\n\nBagaimana menurut Anda? Apakah saat ini Anda sudah dapat membedakan apa itu Machine Learning dan AI? Jika Machine Learning adalah salah satu bagian dari kelompok keilmuan AI, apakah menurut Anda ada lagi keilmuan lain yang juga jadi bagian dari AI? Yuk kita sharing pada forum diskusi agar dapat memberikan perspektif yang berbeda satu sama lain.\n\nDeep Learning\nSetelah Anda mempelajari Machine Learning, mari kita selami lebih dalam bagian dari Artificial Intelligence yang ada pada kelas ini. Kenalkan, ia adalah Deep Learning!\n\nKalau sebelumnya kita sudah tahu bahwa Machine Learning merupakan bagian dari AI, di sini kita belajar bahwa Deep Learning merupakan bagian dari Machine Learning. Namun, perlu kamu ketahui bahwa Deep Learning memiliki pengolahan dan komputasi yang lebih kompleks sehingga dapat menangani permasalahan yang lebih kompleks.\n\nDeep Learning merupakan pembelajaran mesin yang didasari oleh jaringan saraf tiruan, proses yang lebih kompleks daripada Machine Learning karena pada tahapan ini proses pembelajarannya terdiri dari beberapa bagian mulai dari input, hidden layer, dan output.\n\nJaringan saraf tiruan menerima masukan berupa bilangan numerik kemudian memproses masukan tersebut untuk menghasilkan sebuah keluaran. Pada sebuah jaringan saraf tiruan, semakin banyak jumlah hidden layer dalam sistem, semakin lama jaringan saraf tersebut memproduksi hasil, tetapi juga semakin kompleks masalah yang dapat diselesaikan. Namun, pada modul ini kita tidak akan membahas jaringan saraf tiruan lebih dalam agar dapat memahami hal yang lebih dasar mengenai AI. Oleh karena itu, sampai berjumpa di modul selanjutnya ya!\n\nLumayan panjang juga pembahasannya, ya. Tenang saja, kita akan membahas perbedaan dari Machine Learning dan Deep Learning secara lebih detail di modul selanjutnya. Oleh karena itu, tetap semangat karena kita akan menelisik lebih lanjut terkait Deep Learning pada akhir kelas ini.\n\nGenerative AI\nKita telah sampai pada bagian terakhir dari kelompok AI yang ada pada kelas ini, Generative AI merupakan bagian lebih dalam dari Deep Learning. Pembelajaran Generative AI dapat menghasilkan berbagai konten baru berdasarkan input yang diberikan oleh pengguna.\n\nBiasanya, model yang dibangun oleh Generative AI dapat menghasilkan berbagai konten mulai dari bahasa, kode, suara, hingga gambar. Salah satu contoh implementasi Generative AI adalah DALL-E. DALL-E sendiri merupakan Generative AI yang dapat menciptakan gambar dari deskriptif tekstual. Misalnya, contoh deskripsinya adalah “pantai dengan langit yang biru”. Setelah mengetikkan deskripsi tersebut, DALL-E akan menampilkan hasil gambar seperti berikut.\n\ndos-f2da1c871fa139d0037ac940e3eb6dda20231217182342.jpeg\n\nGambar di atas merupakan salah satu bentuk dari penerapan Generative AI. Namun, pada kelas ini kita tidak akan membahas terlalu dalam mengenai Generative AI. Sejatinya kelas ini didesain untuk mengenalkan AI mulai dari Machine Learning hingga Deep Learning agar kita dapat memahami perbedaannya dengan fasih.\n\nNah, itu dia kelompok keilmuan pada AI yang perlu kalian ketahui dasarnya. Semoga dengan pembahasan di atas, Anda makin tertarik dan gigih untuk belajar dasar AI hingga dapat membuat AI untuk diterapkan di kehidupan sehari-hari. Tetap semangat, ya!"
  },
  {
    "id": 1007,
    "title": "AI Workflow",
    "content": "AI Workflow\nSetelah kita mengetahui taksonomi AI pada materi sebelumnya, lantas bagaimana tahapan pengembangan AI secara umum? Mari kita mulai perjalanan yang menyenangkan ini bersama-sama.\n\ndos-995b2dfe375d3fb637f70e926b21bc1e20231217182606.jpeg\n\nPada tahap ini, Anda akan memahami AI workflow yang merupakan gambaran umum terkait tahapan-tahapan yang ada pada proses pengembangan AI. Tanpa berlama-lama yuk kita mulai membahas tahapan yang ada pada proses pengembangan AI.\n\nDigitalise & Collect\nDigitalise & collect merupakan tahapan pengumpulan dan penyimpanan data yang akan digunakan pada proses pembangunan AI. Digitalise di sini berarti melakukan perubahan data agar dapat disimpan di komputer.\n\nPada beberapa perusahaan, data masih disimpan secara tradisional seperti kertas, sehingga tidak bisa digunakan langsung dalam AI. Proses digitalise mengubah data kertas menjadi digital.\n\nJika ingin membuat AI sendiri, proses pengumpulan data tidak semudah mengunduh dataset jadi. Data harus dikumpulkan dari berbagai sumber seperti database, file, sensor, dan lainnya. Tahap ini juga melibatkan berbagai tipe data:\n- Structured data: Excel, SQL, dll.\n- Unstructured data: teks, email, video, audio, gambar, sensor, dll.\n\nTahap ini kunci untuk menentukan tugas sistem AI berdasarkan data yang dikumpulkan.\n\nTransform\nTransform berarti proses perubahan data. Data yang dikumpulkan diproses berulang mulai dari persiapan, pengubahan format, hingga evaluasi untuk menghapus data yang tidak dibutuhkan.\n\nTrain\nSetelah data siap, tahap train/ pelatihan menentukan algoritma yang cocok untuk AI. Tujuannya agar komputer mempelajari data sehingga bisa melakukan tugas berdasarkan data yang dipelajari.\n\nSeperti dicatat dalam buku Jie Ding dkk., \"tidak ada model yang cocok secara universal untuk semua data dan tujuan.\" Oleh karena itu, trial and error diperlukan untuk menemukan algoritma optimal.\n\nExecute\nPada tahap execute, model AI yang telah dilatih digunakan untuk melakukan tugas. Keakuratan model dievaluasi secara terus-menerus, dan proses ini dianalisis ulang untuk memastikan sistem memenuhi harapan serta memberi umpan balik untuk perbaikan.\n\nProvide Insights to Make Decisions\nSetelah model berjalan, tahap ini mengekstrak wawasan dari model untuk membantu pengambilan keputusan dan pemahaman lebih lanjut.\n\nJika data terus berubah, model perlu diperbarui melalui retraining secara reguler. Sistem otomatis juga dapat dibuat untuk memperbarui model secara berkelanjutan.\n\nSampai di sini, Anda telah memahami alur pengembangan AI. Di kelas Belajar Dasar AI ini, Anda juga akan mempelajari pembangunan AI lebih dalam hingga ke Deep Learning. Tetap semangat belajar!"
  },
  {
    "id": 1008,
    "title": "[Story] Belajar Mempermudah Pekerjaan dengan AI",
    "content": "[Story] Belajar Mempermudah Pekerjaan dengan AI\nHalo semuanya! Setelah Anda membaca modul pertama yang mengawali perjalanan Anda mempelajari AI, di sini mari kita simak perjalanan salah satu kisah seorang mahasiswa yang sedang merasa bosan karena mengerjakan tugas yang berulang-ulang. Harapannya setelah Anda membaca kisah ini, Anda dapat menemukan korelasi antara materi yang sudah disuguhkan dengan kehidupan sehari-hari.\n\nSebelumnya, perkenalkan Kai. Ia adalah seorang mahasiswa baru yang memiliki ambisi besar.\n\ndos-767f249cd62d7723d2398fe8f696cfc120231217183127.jpeg\n\nKai merupakan anak tunggal dari keluarga yang cukup harmonis, ibu dan ayahnya juga seorang pekerja yang memiliki kesibukan tersendiri. Selain itu, keluarganya juga memiliki sebuah toko kelontong yang harus dijaga dan dirawat. Karena orang tuanya sibuk, Kai-lah yang diminta untuk selalu mengurus toko keluarganya itu.\n\nHari demi hari Kai lewati dengan penuh semangat, hingga pada suatu hari ia menerima beberapa tugas kuliah yang amatlah banyak. Namun, di lain sisi juga Kai harus tetap menjaga toko keluarganya itu sendirian. Tugasnya di toko sangatlah banyak mulai dari mengecheck penjualan, menentukan produk yang perlu di restock, hingga mengelompokkan barang berdasarkan kategorinya.\n\ndos-e1a863ddae265798a79c0c8cb8bffc9f20231217183127.jpeg\n\nTugas yang berulang dan selalu bertambah membuat Kai kewalahan dan merasa lelah serta bosan. Ia pun akhirnya curhat ke rekan kuliahnya mengenai permasalahan yang sedang ia alami. Akhirnya, salah satu temannya yang bernama Evans menyarankan untuk mempelajari Artificial Intelligence karena ilmu tersebut dapat membantu menyelesaikan permasalahan yang Kai alami saat ini.\n\ndos-84365dbf49594bd824217bb199d262b520231217183127.jpeg\n\nAkhirnya, saat itu juga Kai merasa bahwa ia harus segera mempelajari ilmu tersebut agar dapat membantu meringankan pekerjaannya dan bisa lebih fokus untuk kuliah.\n\nPermasalahan tidak berhenti di sana. Karena Kai seorang mahasiswa yang baru mengenal teknologi, ia merasa kebingungan dengan hasil pencarian terkait AI yang tersebar di internet. Ia merasa bingung karena informasi tentang AI sangatlah luas sehingga ia tidak tahu harus mulai dari mana.\n\ndos-48eb6f851d7589ae634841ea439d7ccd20231217183125.jpeg\n\nHingga akhirnya ia menemukan sebuah taksonomi AI dan memutuskan untuk mempelajari taksonomi tersebut. Lalu, ia mengetahui bahwa di dalam AI terdapat beberapa subset, seperti Machine Learning, Deep Learning, dan Generative AI. Setelah membaca perbedaan dari masing-masing subset, ia merasa bahwa tugasnya di toko dapat ditangani oleh AI!\n\nSetelah mempelajarinya selama beberapa waktu, Kai sekarang sudah memiliki pengetahuan lebih dalam mengenai AI hingga ke contoh penerapannya. Kai memiliki motivasi yang sangat tinggi untuk segera melakukan implementasi pengetahuannya terhadap kasus yang ia alami di kehidupannya. Namun, ia masih memiliki satu pertanyaan yang menggantung di pikirannya. Ia bertanya-tanya, “Apa yang membuat AI dapat mengerjakan tugas yang sudah diberikan?”\n\nUntuk menjawab pertanyaan Kai tersebut, simak kelanjutan kisahnya di modul berikutnya. Sampai jumpa!"
  },
  {
    "id": 1009,
    "title": "Pengenalan Data",
    "content": "Pengenalan Data\nHai, selamat datang di modul Data untuk AI! Pada modul sebelumnya, Anda sudah mengetahui apa itu AI dan tahapan mengembangkan AI secara umum. Jika Anda ingat pada tahapan pengembangan AI, data memiliki peranan penting pada setiap proses pengembangannya. Oleh karena itu, pada modul ini Anda akan belajar mengenal data secara umum, kriteria data untuk AI, hingga gambaran infrastruktur data di industri agar dapat memahami pentingnya data dalam proses pengembangan AI.\n\nMateri yang akan dibahas pada modul ini antara lain:\n- Pengertian data\n- Perbedaan data, dataset, dan basis data\n- Gambaran infrastruktur data di industri\n\nMari kita mulai pembelajaran terkait data untuk AI agar Anda lebih dekat dengan pengembangan AI yang sesungguhnya. Semangat!\n\nApa Itu Data\nData merupakan fondasi penting dalam pengembangan AI. Kualitas dan jumlah data yang baik dapat memengaruhi hasil pengembangan AI. Data adalah kenyataan yang dapat diproses komputer, berupa teks, angka, gambar, atau suara. Tata Sutabri menyatakan data adalah bentuk mentah yang perlu diolah untuk menghasilkan informasi.\n\ndos-8c0863611c86b97b2afc8b9ddf38167520231217184442.jpeg\n\nDari ketiga pengertian di atas, data dapat disimpulkan sebagai informasi yang benar, fakta, dan nyata (raw facts).\n\nData, Dataset, dan Basis Data\nPemahaman tentang perbedaan data, dataset, dan basis data penting agar informasi dapat dikelola dan dimanfaatkan dengan efisien. \n- Data: entri tunggal, fakta, atau informasi individual.\n- Dataset: kumpulan data yang disusun secara terstruktur, biasanya dalam tabel (CSV, Excel, JSON) untuk tujuan tertentu seperti analisis atau pembangunan AI.\n- Basis Data: kumpulan data yang diatur dan disimpan secara terorganisir, bisa menyimpan banyak tipe data dan digunakan untuk berbagai aplikasi.\n\ndos-1c57ee7423a2e0031d86293acc32a20920231217184441.jpeg\n\ndos-3d7f22c4abf08c0c0f64990bc2d032aa20231217184441.jpeg\n\ndos-bb3cf4b0b339c696033148825e04e92020231217184442.jpeg\n\nTipe-Tipe Data\nData dapat dibagi menjadi data terstruktur dan tidak terstruktur.\n\nData Terstruktur\nData terstruktur memiliki format tetap, mudah dibaca dan dianalisis. Terbagi menjadi:\n- Data Kuantitatif: angka, dapat diukur. Contoh: tinggi, berat, usia.\n  - Data Kontinu: bilangan numerik bisa pecahan (misal suhu, waktu).\ndos-6384817447f47d2270ce718e1dd5c8dc20250204084619.jpeg\n  - Data Diskrit: bilangan bulat, tidak bisa dibagi lebih kecil. Contoh: stok produk.\n\n- Data Kategorikal: informasi berupa label atau nama.\n  - Data Ordinal: memiliki urutan/peringkat. Contoh: rating kelas.\ndos-aa36b95830acbc9b0b94f5732a66285b20250204084843.jpeg\ndos-41f3b4ce2fb87cbeede0b1f57c12a87020250204084853.jpeg\n  - Data Nominal: tidak memiliki urutan, hanya kategori. Contoh: jenis kelamin.\ndos-4c49923b340b8735b694cd0a78db3f1120250204084936.jpeg\n\nData Tidak Terstruktur\nData tidak terstruktur tidak memiliki format jelas, bervariasi dan sulit diorganisasi. Contohnya teks bebas, gambar, video, dan audio.\ndos-6686a44523d83e10a9516ba6823ee9e220231217184442.jpeg\n\nModul ini memberikan pemahaman dasar tentang data untuk AI. Kita akan membahas data tidak terstruktur lebih dalam di modul selanjutnya. Tetap semangat!"
  },
  {
    "id": 1010,
    "title": "Kriteria Data untuk AI",
    "content": "Kriteria Data untuk AI\nHai, selamat datang kembali! Setelah Anda mendalami data untuk AI sebelumnya, sampailah kita pada bagian yang paling penting untuk membangun sebuah sistem AI berdasarkan data yang kita miliki. Pada modul ini, kita akan membahas kriteria data untuk AI.\n\nGarbage in, Garbage out (GIGO)\nPernah dengar pepatah \"garbage in, garbage out\" atau GIGO? Artinya, output suatu sistem komputer tidak akan lebih baik dibandingkan inputnya. Jika data yang dimasukkan buruk, AI yang dibangun juga akan menghasilkan output yang tidak sesuai harapan.\n\ndos-a5f8865a7fbd309eb3a27b44b75d2f2120231217190229.jpeg\n\nData yang buruk bisa berupa data tidak relevan, salah, keliru, atau tidak wajar. Oleh karena itu, kualitas data sangat penting dalam pengembangan AI.\n\nMasalah dalam Data\nPermasalahan data biasanya terjadi karena kesalahan pengumpulan atau pencatatan, atau sumber data yang tidak dapat dipercaya. Beberapa masalah umum pada data antara lain:\n- Data tidak relevan (incorrect)\n- Data berbeda atau outlier\n- Data duplikat\n- Data kosong\n- Data tidak benar\n\nContohnya, data kosong dapat ditangani dengan menghapus baris data tersebut atau mengisinya dengan nilai rata-rata atau median jika data bersifat numerik.\n\nIntinya, data yang bermasalah dapat diperbaiki sehingga menghasilkan data yang lebih baik. Pada modul berikutnya, kita akan mempelajari cara menangani masalah data secara lebih detail. Tetap semangat!"
  },
  {
    "id": 1011,
    "title": "Infrastruktur Data di Industri",
    "content": "Infrastruktur Data di Industri\nSetelah kita mengenal data, penting juga untuk memahami pengelolaan, penyimpanan, dan proses analisis data melalui infrastruktur data.\n\nInfrastruktur data mencakup hardware, software, dan teknologi jaringan yang mendukung pengelolaan data. Tujuannya adalah untuk menyediakan pengelolaan data yang baik, memproses data, dan menganalisis data yang ada.\n\nTujuan Infrastruktur Data:\n1. Manajemen Data\n   Infrastruktur data yang baik membuat tempat penyimpanan data terpusat, sehingga data dalam organisasi lebih aman dan mudah dikelola.\n\n2. Pemrosesan Data\n   Infrastruktur menyediakan daya komputasi dan sumber daya untuk memproses serta menganalisis data dalam jumlah besar, memungkinkan analisis kompleks dan pengambilan keputusan berbasis data.\n\n3. Integrasi Data\n   Infrastruktur data memungkinkan integrasi data dari berbagai sumber untuk mendukung pemodelan dan analisis yang lebih lengkap.\n\n4. Keamanan Data\n   Infrastruktur menyediakan protokol keamanan untuk melindungi data sensitif dari akses tidak sah, pencurian, atau penyalahgunaan, serta memastikan kepatuhan terhadap peraturan dan praktik terbaik keamanan data.\n\nDengan memahami infrastruktur data, organisasi dapat memanfaatkan data secara optimal untuk pengambilan keputusan yang lebih baik. Jika masih ada pertanyaan, jangan ragu untuk berdiskusi di forum kelas."
  },
  {
    "id": 1012,
    "title": "[Story] Apa yang Diperlukan untuk Membuat AI?",
    "content": "[Story] Apa yang Diperlukan untuk Membuat AI?\nDi kisah sebelumnya, Kai masih memiliki pertanyaan yang mengganggu pikirannya. Ia telah mengetahui AI, contoh penerapannya, hingga alur untuk membangun AI, tetapi belum mengetahui bahwa AI membutuhkan data agar dapat menjalankan tugasnya dengan baik.\n\nDengan rasa penasaran dan keinginan mempermudah kehidupannya, Kai bertanya kepada salah satu dosennya, “Apa yang membuat AI dapat mengerjakan tugasnya?”\n\ndos-95c12164edb16f1dfa8f4599022668fb20231217192805.jpeg\n\nDosennya menjelaskan bahwa AI bekerja dengan menggabungkan data dan melakukan pengolahan, sehingga komputer dapat belajar dan menjalankan tugas secara otomatis berdasarkan pola atau fitur dalam data. Dosen menyarankan Kai untuk mempelajari data terlebih dahulu agar dapat membangun AI dengan baik.\n\nSelepas kuliah, Kai mempelajari hal tersebut. Ia menemukan fakta bahwa data yang digunakan untuk pembangunan AI adalah hal yang bisa dipelajari komputer untuk mengerjakan tugasnya. Saat ini, Kai sudah mengetahui bahwa ia perlu mempelajari data lebih dalam, mulai dari pengenalan data hingga tipe-tipe data. Motivasi Kai pun bertambah karena ia tahu langkah pertama untuk membangun sistem AI.\n\nKai kemudian menemukan bahwa data tidak bisa digunakan begitu saja. Kualitas data sangat memengaruhi hasil sistem yang dibuat. Beberapa masalah umum pada data yang harus diperhatikan meliputi data tidak relevan (incorrect), outlier, data duplikat, data kosong, data tidak benar, dan lain-lain.\n\ndos-1c853f9803500a7222f09df4884d9f1320231217192805.jpeg\n\nAkhirnya, Kai menyadari peran penting data dalam pengembangan AI dan tidak sabar untuk mengimplementasikan sistem berbasis data di tokonya agar tugasnya menjadi lebih mudah.\n\nPenasaran apa yang akan dibangun Kai pada kisah selanjutnya? Simak terus perjalanan Kai hingga ia dapat mengotomatisasi semua tugas di tokonya.\n\nSebelumnya: Infrastruktur Data di Industri"
  },
  {
    "id": 1013,
    "title": "Tipe-Tipe Machine Learning",
    "content": "Tipe-Tipe Machine Learning\nMachine learning dibagi menjadi beberapa kategori, antara lain supervised learning, unsupervised learning, dan reinforcement learning.\n\ndos-5a0bebb91a0e65dfeac0e5a35dde240620240106141424.jpeg\n\nPembagian kategori didasarkan pada karakteristik data dan jenis supervisi yang diterima program selama pelatihan.\n\nSupervised Learning\nSupervised learning menggunakan data yang memiliki label atau jawaban. Model machine learning mempelajari karakteristik input berdasarkan label yang ada, sehingga dapat memprediksi output yang sesuai.\n\ndos-40e47ef1e6a004571f13b3db940a1cd620240106141424.jpeg\n\nContoh: dataset buah-buahan (apel dan stroberi) dengan label. Model belajar mengenali karakteristik masing-masing buah dan dapat mengklasifikasikan gambar buah baru.\nSupervised learning banyak digunakan karena penggunaan jelas, mudah dipahami, dan akurasi dapat dievaluasi. Dua metode utamanya adalah classification dan regression.\n\nUnsupervised Learning\nBerbeda dengan supervised learning, unsupervised learning menggunakan data tanpa label. Model belajar sendiri untuk menemukan pola atau struktur dalam data.\n\ndos-251df831d2342017caab09029de144a820240106141423.jpeg\n\nContoh: dataset sayuran tercampur. Model dapat mengelompokkan data berdasarkan kesamaan karakteristik. Cocok untuk eksplorasi data, segmentasi pelanggan, pengenalan pola, dan analisis clustering.\n\nReinforcement Learning\nReinforcement learning (RL) mempelajari bagaimana membuat keputusan terbaik secara berurutan untuk memaksimalkan reward. Agent belajar melalui trial and error dengan reward atau penalti.\n\ndos-e397996a66d6711701206dbbed32e9a920240106141421.jpeg\n\nContoh ilustrasi: Kai sebagai agent belajar menaati peraturan kelas. Agent membuat policy awal secara acak, melakukan aksi, menerima reward/penalti, dan memperbarui policy untuk memaksimalkan reward.\n\ndos-d504e0fb02b2fb3273e447a224327cbc20240106141427.jpeg\n\ndos-6159c7044fe90b8e619ed6b58722428f20240106141420.jpeg\n\nDengan pemahaman ketiga tipe machine learning ini, kita dapat melanjutkan ke tahapan yang perlu dilalui sebelum membuat project machine learning.\n\nBeli jamu ke Irian Jaya, buat kamu tetap semangat!"
  }
]
